In [1]:
import pandas as pd

In [2]:
# загружаем данные
df = pd.read_csv('Data/alfa_python_test.csv')
# смотрим первые 5 наблюдений
df.head()

                           city                 date   id
0   Kazan, St-Petersburg, Sochi  2014-10-06 03:16:18   49
1                 Moscow, Kazan  2013-01-04 09:44:04  252
2                 Kazan, Moscow  2013-12-04 11:39:03  208
3          St-Petersburg, Kazan  2014-09-04 10:09:53   81
4  St-Petersburg, Moscow, Sochi  2014-09-25 02:04:14  109

In [3]:
# смотрим типы переменных и наличие пропусков
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 3 columns):
city    805 non-null object
date    1000 non-null object
id      1000 non-null int64
dtypes: int64(1), object(2)
memory usage: 23.5+ KB

In [4]:
# приводим столбец date к типу datetime 
df['date'] = pd.to_datetime(df['date'])

In [5]:
# отсортируем и выведем первые 10 наблюдений
df.sort_values('id').head(10)

                                    city                date  id
106         Kazan, Moscow, St-Petersburg 2014-10-06 20:58:34   0
157                        Moscow, Sochi 2013-09-24 18:06:24   0
335                               Moscow 2013-06-27 21:55:49   0
150                                Sochi 2014-02-19 22:19:14   1
300  Sochi, St-Petersburg, Moscow, Kazan 2013-03-18 06:46:12   1
873  St-Petersburg, Moscow, Sochi, Kazan 2014-11-04 11:53:27   1
86                         Moscow, Sochi 2014-09-14 12:37:29   1
46   Sochi, St-Petersburg, Kazan, Moscow 2014-03-20 21:25:05   2
224  Moscow, Kazan, St-Petersburg, Sochi 2014-07-02 02:04:42   2
484                                  NaN 2014-05-21 10:29:54   3

## 1. Для каждого уникального id оставьте только одну строку с самой поздней датой.

In [6]:
# для каждого уникального id оставим только одну строку с самой поздней датой,
# idmax() выдаёт индексы максимальных значений, в нашем случае - в колонке 'date'
df = df.loc[df.groupby('id')['date'].idxmax()].sort_values('id')
df.head(10)

                                    city                date  id
106         Kazan, Moscow, St-Petersburg 2014-10-06 20:58:34   0
873  St-Petersburg, Moscow, Sochi, Kazan 2014-11-04 11:53:27   1
224  Moscow, Kazan, St-Petersburg, Sochi 2014-07-02 02:04:42   2
819                        Moscow, Sochi 2014-10-31 13:06:28   3
983  Kazan, Moscow, Sochi, St-Petersburg 2013-06-10 22:25:47   4
470                 Kazan, Sochi, Moscow 2013-03-23 11:45:54   5
76          St-Petersburg, Sochi, Moscow 2014-02-06 23:17:13   6
709                 Sochi, St-Petersburg 2013-10-01 10:10:24   7
265                                Kazan 2014-04-30 04:47:09   8
80          Moscow, Sochi, St-Petersburg 2013-11-07 11:38:20   9

In [7]:
# удаляем пропуски
df.dropna(inplace=True)

## 2. Cколько в каждом городе было уникальных id?

In [8]:
# создаем пустой список
cities = []

# с помощью цикла подсчитываем количество
# уникальных вхождений каждого города
for city in sorted(df['city'].unique()):
    for i in city.split(', '):
        if i not in cities:
            cities.append(i)
            # печатаем название города
            print(i)
            # печатаем количество уникальных вхождений
            print(df['city'].str.contains(i).sum())

Kazan
163
Moscow
163
Sochi
166
St-Petersburg
153

## 3. Сколько id содержится в каждом множестве городов?

1. С помощью метода split() разбиваем строку (строковое значение столбца City) на части, используя разделитель (в данном случае - запятую), и возвращаем эти части в виде списка.
2. Выполняем сортировку эти частей через функцию sorted().
3. С помощью метода join() разделяем части запятыми, таким образом, получаем единый формат множеств: например, "Sochi, Moscow" станет "Moscow, Sochi".
4. С помощью комбинации map + lambda вышеописанные три пункта применяем для каждой строки.

In [9]:
df['city'] = df['city'].map(lambda x: ', '.join(sorted(x.split(', '))))
df['city'].value_counts()

Kazan, Moscow, Sochi, St-Petersburg    70
Kazan, Moscow, Sochi                   29
Moscow, Sochi, St-Petersburg           18
Kazan, Moscow, St-Petersburg           16
Sochi                                  15
St-Petersburg                          15
Kazan                                  12
Kazan, Sochi, St-Petersburg            11
Kazan, Moscow                          10
Sochi, St-Petersburg                    8
Kazan, St-Petersburg                    8
Moscow, Sochi                           8
Moscow, St-Petersburg                   7
Kazan, Sochi                            7
Moscow                                  5
Name: city, dtype: int64